[
  {
    "id": "1",
    "product": "Medicare Advantage",
    "slug": "medicare-advantage",
    "productImage": "../images/background/fbihi-bg-14.jpg",
    "content": [
      "Medicare Advantage plans first came into Hawaii in 2005.  A Medicare Advantage Plan is another Medicare Health Plan choice you may have as part of Medicare.",
      "Medicare Advantage Plans, sometimes called “Part C” plans, are offered by private insurance companies approved by Medicare to administer the plan benefits.  If you join a Medicare Advantage Plan, the plan will provide all of your Part A (Hospital Insurance) and Part B (Medical Insurance) coverage.",
      "Medicare Advantage Plans must cover all of the services that Original Medicare covers except hospice care. Original Medicare covers hospice care even if you are in a Medicare Advantage Plan",
      "For many people, Medicare Advantage Plans are a good value because they can offer the same coverage as Original Medicare parts A & B, plus additional health benefits at a low or no additional monthly premium beyond the Medicare Part B premium.",
      "Additional benefits are often included, such as vision services, hearing services, health screening tests and nurse helplines. Most Medicare Advantage Plans also cap your out-of-pocket spending for the year. Part D prescription drug coverage is also integrated with many Medicare Advantage Plans.",
      "Social Security provides the bulk of most retirees' income and Medicare guarantees them affordable health insurance.  Few people know what Medicare covers and what it doesn't, what it costs, and when to sign up.  Nor do they understand which parts of Medicare are provided by the government and how these work with private insurance plans -- Medicare Advantage (MA), Prescription Drug Plan (PDP), and Medicare Supplemental (Medigap) plans.",
      "Do you understand Medicare parts A, B, C, D?  Which Part D drug plan is right and how do you decide?  Which is better, Medigap or Medicare Advantage?  What do you do if Medicare denies payment for a procedure that your doctor says you need?  How do you navigate the appeals process for denied claims?  If you're still working or have a retiree health plan, how do these benefits work with Medicare?  Do you know about the annual enrollment period for Medicare, or about lifetime penalties for late enrollment, or any number of key Medicare rules?  This is our expertise and where we can help.",
      "Please call us so one of our agents can go over your various options with a Medicare Advantage, Medicare Supplement, or Medicare Prescription Drug plan at 808-792-5194."
    ]
  },
  {
    "id": "2",
    "product": "Final Expense",
    "slug": "final-expense",
    "productImage": "../images/background/fbihi-bg-15.jpg",
    "content": [
      "Final Expense (also known as Burial Insurance)",
      "Final Expense Insurance is one of the greatest gifts you can provide for your loved ones. Providing your family with the money needed to cover your final expenses is something that simply makes sense.",
      "Too many Americans find themselves without adequate financial resources. Sadly, most of them aren't even aware that a life insurance policy can cover these expenses obligations.",
      "How final expense insurance can help: • Immediate cash benefits • Benefits paid directly to your beneficiary • Your rates can never be increased • No medical exam • Guaranteed renewable • Accelerated benefits • Cash and loan value • Paid-up insurance • Spare your loved ones from the financial burden of final expenses."
    ]
  },
  {
    "id": "3",
    "product": "Annuity",
    "slug": "annuity",
    "productImage": "../images/background/fbihi-bg-02.jpg",
    "content": [
      "Life spans in the United States have been increasing for over a hundred years. It is now common for people who reach retirement age to live 20 years or more in retirement, most of those years in good health. It's good to live a long and full life, but you want to be sure that your income lasts as long as you do, and its purchasing power is as strong as you are. How can you manage the risk of 'outliving your assets'?",
      "Annuities are a unique financial product that, along with Social Security, employer pensions, your 401(k) plan, IRA and other assets, can enhance your retirement security. Discuss this option with your insurance professional or financial planner when mapping out your retirement strategy.",
      "What is an annuity? In its most general sense, an annuity is an agreement for one person or organization to pay another a stream or series of payments. Usually the term 'annuity' relates to a contract between you and a life insurance company, but a charity or a trust can take the place of the insurance company.",
      "There are many categories of annuities. They can be classified by:",
      "Nature of the underlying investment - fixed or variable",
      "Primary purpose - accumulation or pay-out (deferred or immediate)",
      "Nature of pay-out commitment - fixed period, fixed amount, or lifetime Tax status - qualified or nonqualified",
      "Premium payment arrangement - single premium or flexible premium",
      "An annuity can be classified in several of these categories at once. For example, you might buy a nonqualified single premium deferred variable annuity. For brief definitions of these categories, click here.",
      "In general, annuities have the following attractive features:",
      "Tax deferral on investment earnings Many investments are taxed year by year, but the investment earnings?capital gains and investment income?in annuities aren't taxable until you withdraw money. This tax deferral is also true of 401(k)s and IRAs; however, unlike these products, there are no limits on the amount you can put into an annuity. Moreover, the minimum withdrawal requirements for annuities are much more liberal than they are for 401(k)s and IRAs. Protection from creditors",
      "If you own an immediate annuity (that is, you are receiving money from an insurance company), generally the most that creditors can access is the payments as they're made, since the money you gave the insurance company now belongs to the company. Some state statutes and court decisions also protect some or all of the payments from those annuities. And your money in tax-favored retirement plans, such as IRAs and 401(k)s, are generally protected, whether invested in an annuity or not.",
      "An array of investment options, including 'floors' Many annuity companies offer a variety of investment options. You can invest in a fixed annuity which would credit a specified interest rate, similar to a bank Certificate of Deposit (CD). If you buy a variable annuity, your money can be invested in stock or bond (or other) mutual funds. In recent years, annuity companies have created various types of 'floors' that limit the extent of investment decline from an increasing reference point. For example, the annuity may offer a feature that guarantees your investment will never fall below its value on its most recent policy anniversary.",
      "Tax-free transfers among investment options In contrast to mutual funds and other investments made with 'after-tax money,' with annuities there are no tax consequences if you change how your funds are invested. This can be particularly valuable if you are using a strategy called 'rebalancing,' which is recommended by many financial advisors. Under rebalancing, you shift your investments periodically to return them to the proportions that you determine represent the risk/return combination most appropriate for your situation.",
      "Lifetime income A lifetime immediate annuity converts an investment into a stream of payments that last as long as you do. In concept, the payments come from three 'pockets': Your investment, investment earnings and money from a pool of people in your group who do not live as long as actuarial tables forecast. It's the pooling that's unique to annuities, and it's what enables annuity companies to be able to guarantee you a lifetime income.",
      "Benefits to your heirs There is a common misconception about annuities that goes like this: if you start an immediate lifetime annuity and die soon after that, the insurance company keeps all of your investment in the annuity. That can happen, but it doesn't have to. To prevent it, buy a 'guaranteed period' with the immediate annuity. A guaranteed period commits the insurance company to continue payments after you die to one or more beneficiaries you designate; the payments continue to the end of the stated guaranteed period?usually 10 or 20 years (measured from when you started receiving the annuity payments). Moreover, annuity benefits that pass to beneficiaries don't go through probate and aren't governed by your will."
    ]
  },
  {
    "id": "4",
    "product": "Long Term Care",
    "slug": "long-term-care",
    "productImage": "../images/background/fbihi-bg-01.jpg",
    "content": [
      "What is Long Term Care Insurance? Because of old age, mental or physical illness, or injury, some people find themselves in need of help with eating, bathing, dressing, toileting or continence, and/or transferring (e.g., getting out of a chair or out of bed). These six actions are called Activities of Daily Living-sometimes referred to as ADLs. In general, if you can't do two or more of these activities, or if you have a cognitive impairment, you are said to need 'long-term care.'",
      "Long-term care isn't a very helpful name for this type of situation because, for one thing, it might not last for a long time. Some people who need ADL services might need them only for a few months or less.",
      "Many people think that long-term care is provided exclusively in a nursing home. It can be, but it can also be provided in an adult day care center, an assisted living facility, or at home. Assistance with ADLs, called 'custodial care,' may be provided in the same place as (and therefore is sometimes confused with) 'skilled care.' Skilled care means medical, nursing, or rehabilitative services, including help taking medicine, undergoing testing (e.g. blood pressure), or other similar services. This distinction is important because Medicare and most private health insurance pays only for skilled care-not custodial care.",
      "Should I buy long-term care insurance?",
      "If you need long-term care services and have to pay to obtain them, what financial resources could you call on? Do you have enough to pay for four or more years in a nursing home, an assisted living facility, or home health care?",
      "If you're over 65, don't rely on Medicare or private health insurance. Medicare doesn't pay for custodial care, and private health insurance rarely pays any of the cost of long-term care. If you expect to have very little money when you need long-term care services, you might qualify for Medicaid, a government program that pays the medical and long-term care expenses of poor people. If you expect to be in that situation, you probably shouldn't buy long-term care insurance, because your state's Medicaid program will pay your long-term care expenses. Buying long-term care insurance would only save the state?not you?money. The exception is if you live in California, Connecticut, Indiana, or New York, states that have a Partnership for Long-Term Care program. For residents of these four states, buying long-term care insurance does offer an additional benefit.",
      "If you expect to have a lot of money when you need long-term care services, you also probably shouldn't buy long-term care insurance. Instead, you should plan to pay for the care 'out of pocket' that is, as a regular expense. One financial advisor suggested in a newspaper interview that if your net worth is in the $1.5 million range, not including the value of your home, you could safely skip buying long-term care insurance and treat long-term care expenses, if they arise, as you do your other bills.",
      "If you fall in-between these two categories, owning long-term care insurance, like all other insurance coverages, offers peace-of-mind benefits as well as financial ones. For example, a recent survey of people age 50 and over asked how confident they were that they could pay for long-term care services if they needed them. Among those with long-term care policies, 52 percent said they were very confident and another 40 percent said they were somewhat confident. Among those who didn't own a long-term care policy, only 8 percent were very confident and only 27 percent were somewhat confident.",
      "But if you're under 85?and especially if you're under 65?that doesn't mean you should ignore the topic of long-term care insurance because: You might already be unable to buy long-term care insurance. Wakely Consulting Group, an actuarial firm, studied applicants for long-term care insurance in 2003-2004; the findings: 11 percent of applicants in their 50s, 19 percent in their 60s and 43 percent in their 70s were rejected.",
      "A Milliman & Robertson actuary estimated that 15 to 25 percent of the over-65 age group are uninsurable for long-term care.",
      "A report from the Henry J. Kaiser Foundation indicates that over five million people ages 18-64 need some type of long-term care.",
      "The latest data from the National Center for Health Statistics (for 1999) reported that roughly 160,000 of the people living in nursing homes were under age 65 (nearly 10 percent of the total). Of those receiving home health care services, roughly 400,000 were under 65 (about 30 percent of the total).",
      "In Hawaii, the median bill for a private room in a nursing home is $135,050 annually.  One year in an assisted living facility will be about $48,000.  A median hourly cost for services of a home health aid from a private agency to come to the house will be $20-35 per hour.",
      "So, unless you have so little money that you will qualify for Medicaid, or so much money that you can pay the bills out of your own pocket, you should consider buying long-term care insurance.  Good thing there are options and choices in your decision making and we are here to help in that process."
    ]
  },
  {
    "id": "5",
    "product": "Medicare Supplements",
    "slug": "medicare-supplements",
    "productImage": "../images/background/fbihi-bg-02.jpg",
    "content": [
      "A Medigap policy is health insurance sold by private insurance companies to fill the “gaps” in Original Medicare Plan coverage. Medigap policies help pay some of the health care costs that the Original Medicare Plan doesn’t cover. If you are in the Original Medicare Plan and have a Medigap policy, then Medicare and your Medigap policy will pay both their shares of covered health care costs.",
      "Generally, when you buy a Medigap policy you must have Medicare Part A and Part B. You will have to pay the monthly Medicare Part B premium. In addition, you will have to pay a premium to the Medigap insurance company.",
      "You and your spouse must each buy separate Medigap policies. Your Medigap policy won’t cover any health care costs for your spouse.",
      "Social Security provides the bulk of most retirees' income and Medicare guarantees them affordable health insurance.  Few people know what Medicare covers and what it doesn't, what it costs, and when to sign up.  Nor do they understand which parts of Medicare are provided by the government and how these work with private insurance plans -- Medicare Advantage (MA), Prescription Drug Plan (PDP), and Medicare Supplemental (Medigap) plans.",
      "Do you understand Medicare parts A, B, C, D?  Which Part D drug plan is right and how do you decide?  Which is better, Medigap or Medicare Advantage?  What do you do if Medicare denies payment for a procedure that your doctor says you need?  How do you navigate the appeals process for denied claims?  If you're still working or have a retiree health plan, how do these benefits work with Medicare?  Do you know about the annual enrollment period for Medicare, or about lifetime penalties for late enrollment, or any number of key Medicare rules?  This is our expertise and where we can help.",
      "Please call us so one of our agents can go over your various options with a Medicare Advantage, Medicare Supplement, or Medicare Prescription Drug plan at 808-792-5194."
    ]
  }
]
