[
  {
    "id": "1",
    "service": "Dental",
    "slug": "dental",
    "content": [
      "Dental Insurance is equally important to Health Insurance because dental disease is still very prevalent.",
      "Dental care is a very important part of any healthy lifestyle, but because dental insurance or dental coverage is not included as part of standard health care insurance, it is something that is often overlooked or forgotten until it is too late. The rising cost of quality dental care means that dental insurance might be just what you and/or your family need to ensure that your teeth remain health and well cared for.",
      "Dental Insurance works very much like health insurance - they come in a variety of “flavors” if you will. PPO, DHMO, POS, Indemnity and Scheduled.",
      "PPO stands for Preferred Provider Organization. Basically, the network of dentists that the members are referred to offer discounted fees to the plan members.You can typically use a dentist outside of the PPO’s network, but you will only be reimbursed the discounted fee for the services rendered and have to pay any additional amount yourself.",
      "DHMO stands for Dental Health Maintenance Organization. The way a DHMO works is it provides you dental services through its network of dentists in exchange for some form of prepayment. If you use a dentist outside of the network, you will most likely be responsible for the entire bill.",
      "POS stands for Point of Service. A POS plan allows you to use either a DHMO dentist or a dentist not in the network. You get to choose in-network care of out-of-network care when you make your dental appointment and typically, you will incur higher out-of-pocket costs for out-of-network care.",
      "An indemnity plan is also known as a traditional plan. With an indemnity plan you can visit any dentist you like. They typically pay a percentage of “usual, customary and reasonable” charges for covered services.",
      "A scheduled plan or scheduled reimbursement plan reimburses you for a set amount based on a fee schedule. The balance due, if any is your responsibility. They include a calendar year maximum, a deductible and waiting periods for certain procedures.",
      "Most dental coverage is designed to ensure that the patient receives regular preventive care. There are three (3) categories of dental procedures. Preventative • Basic or Restorative • Major",
      "When you're shopping for a dental plan there are a number of things you'll need to keep in mind, to make sure that you end up with a policy that's right for you and your situation. As each individual and family have different circumstances please contact us today to evaluate your dental insurance needs and we will work to find the plan the best fits your needs and budget."
    ]
  },
  {
    "id": "2",
    "service": "Group Plans",
    "slug": "group-plans",
    "content": [
      "Business Groups Products: • Group Dental • Group Disability • Group Life • Group Long Term Care • Group Health"
    ]
  },
  {
    "id": "3",
    "service": "Health Insurance",
    "slug": "health-insurance",
    "content": [
      "What kinds of health insurance are there?",
      "There are essentially two kinds of health insurance -- Fee-for-Service and Managed Care. Although these plans differ, they both cover an array of medical, surgical and hospital expenses. Most cover prescription drugs and some also offer dental coverage.Fee-for-Service.",
      "These plans generally assume that the medical professional will be paid a fee for each service provided to the patient. Patients are seen by a doctor of their choice and the claim is filed by either the medical provider or the patient. Managed Care.",
      "More than half of all Americans have some kind of managed-care plan. Various plans work differently and can include: health maintenance organizations (HM0s), preferred provider organizations (PPOs) and point-of-service (POS) plans. These plans provide comprehensive health services to their members and offer financial incentives to patients who use the providers in the plan.",
      "How do I pick a health plan?",
      "If your employer gives you a choice of plans or you need to purchase your own coverage, it is crucial that you understand your health insurance choices and pick the insurance that is best for you and your family.",
      "Here are some questions you should ask yourself when choosing a health insurance plan:",
      "How affordable is the cost of care? What is the monthly premium I will have to pay?",
      "• Should I try to insure most of my medical expenses or just the large ones? • What deductibles will I have to pay out-of-pocket before insurance starts to reimburse me? • After I’ve met my deductible, what percentage of my medical expenses are reimbursed? • How much less am I reimbursed if I use doctors outside the insurance company’s network? • Does the insurance plan cover the services I am likely to use? • Are the doctors, hospitals, laboratories and other medical providers that I use in the insurance company’s network? • If I want to use a doctor outside the network, will the plan permit it? • How easily can I change primary-care physicians if I want to? • Do I need to get permission before I see a medical specialist? • What are the procedures for getting care and being reimbursed in an emergency situation, both at home or out of town? • If I have a preexisting medical condition, will the plan cover it? • If I have a chronic condition such as asthma, cancer, AIDS or alcoholism, how will the plan treat it? • Are the prescription medicines that I use covered by the plan? • Does the plan reimburse alternative medical therapies such as acupuncture or chiropractic treatment? • Does the plan cover the costs of delivering a baby?",
      "What is the quality of the insurance plan I’m looking at?",
      "• How have independent government and non-government organizations rated the plan? For example, the National Committee for Quality Assurance ( http://www.ncqa.org ) issues a Consumer Assessment of Health Plans (CAHPS) report for every medical plan and facility. • What kind of accreditation has the plan received from groups such as NCQA or the Joint Commission on Accreditation of Healthcare Organizations (JCAHO) ( http://www.jcaho.org )? • How many patient complaints were filed against the plan last year and how many were upheld by state regulatory agencies like the state insurance commission or the state medical licensing board? • How many members drop out of the plan each year? State insurance departments keep track of 'disenrollment rates'. • Do the doctors, pharmacies and other services in the plans offer convenient times and locations? • Does the plan pay for preventive health care such as diet and exercise advice, immunizations and health screenings? • What do my friends and colleagues say about their experiences with the plan? • What does my doctor say about his or her experience with the plan?",
      "We are here to assist you in finding a plan that protects your family while staying within your budget. Please contact us today to help evaluate your health insurance options."
    ]
  },
  {
    "id": "4",
    "service": "Life Insurance",
    "slug": "life-insurance",
    "content": [
      "Life Insurance - What are the principal types of life insurance?",
      "There are two major types of life insurance—term and whole life. Whole life is sometimes called permanent life insurance, and it encompasses several subcategories, including traditional whole life, universal life, variable life and variable universal life. In 2003, about 6.4 million individual life insurance policies bought were term and about 7.1 million were whole life. Life insurance products for groups are different from life insurance sold to individuals. The information below focuses on life insurance sold to individuals.",
      "Term Insurance",
      "There are several different types of term insurance you can consider: • Renewable Term Insurance • Convertible Term Insurance • Level Term Insurance • Decreasing Term Insurance • Increasing Term Insurance",
      "Term Insurance is the simplest form of life insurance. It pays only if death occurs during the term of the policy, which is usually from one to 30 years. Most term policies have no other benefit provisions.",
      "There are two basic types of term life insurance policies—level term and decreasing term. Level term means that the death benefit stays the same throughout the duration of the policy. Decreasing term means that the death benefit drops, usually in one-year increments, over the course of the policy’s term.",
      "In 2003, virtually all (97 percent) of the term life insurance bought was level term.",
      "Whole Life / Permanent Insurance",
      "There are four basic types of permanent insurance: • Whole Life • Joint Whole Life • Survivorship Life • Universal Life • Variable Life • Variable Universal",
      "Whole life or permanent insurance pays a death benefit whenever you die—even if you live to 100! There are three major types of whole life or permanent life insurance—traditional whole life, universal life, and variable universal life, and there are variations within each type. In the case of traditional whole life, both the death benefit and the premium are designed to stay the same (level) throughout the life of the policy. The cost per $1,000 of benefit increases as the insured person ages, and it obviously gets very high when the insured lives to 80 and beyond. The insurance company could charge a premium that increases each year, but that would make it very hard for most people to afford life insurance at advanced ages. So the company keeps the premium level by charging a premium that, in the early years, is higher than what’s needed to pay claims, investing that money, and then using it to supplement the level premium to help pay the cost of life insurance for older people.",
      "By law, when these “overpayments” reach a certain amount, they must be available to the policyowner as a cash value if he or she decides not to continue with the original plan. The cash value is an alternative, not an additional, benefit under the policy.",
      "In the 1970s and 1980s, life insurance companies introduced two variations on the traditional whole life product—universal life insurance and variable universal life insurance."
    ]
  },
  {
    "id": "5",
    "service": "Permanent Life Insurance",
    "slug": "permanent-life-insurance",
    "content": [
      "Permanent (cash value) Insurance",
      "It provides life-long protection as long as you continue to pay premiums. The premiums are based on your age at the time of purchase, and generally remain level. They do not increase as you age. Therefore, the younger you are when you buy the policy, the lower the premium you will pay for the life of the policy.",
      "Because premiums remain level, permanent insurance is more expensive than term insurance. But permanent insurance accumulates cash value, which may be refundable upon surrender of the policy. While the policy is in force, cash values can be borrowed against or used to pay premiums.",
      "The proceeds of many permanent life insurance policies can be used to ease the financial burden of catastrophic illness, terminal illness or long-term care. These accelerated benefits may be offered as part of the basic policy or as a rider to an existing policy.",
      "With a permanent life insurance policy, you may borrow up to the cash value at an interest rate (fixed or adjustable) stated in the policy. Any unpaid interest is added to the loan. Any unpaid loan, including interest, will be deducted from the death benefit. The cash value can be used to pay premiums for a period of time, keeping the stated death benefit, or it can be used to purchase paid-up insurance in a lesser amount with no further premiums due.",
      "There are four basic types of permanent insurance: • Whole Life. Sometimes also called life or ordinary life, this policy has a fixed guaranteed rate and develops guaranteed cash values. There are two variations on traditional whole life: ◦ Joint Whole Life: The policy insures two lives instead of one. Also called first-to-die coverage, the policy pays the death benefit to the surviving insured person when the first one dies. This is often purchased by a husband and wife.◦ Survivorship Life: The policy insures two people and pays a death benefit only when the second person has died. It is designed for married couples who want to provide funds to pay estate taxes that may be due after their deaths. Also called second-to-die coverage.• Universal Life. This policy has more flexibility. Within certain limits, you can change the death benefit, the amount of premium and payment frequency. Unlike whole life, this is an 'interest driven' policy, which normally pays a minimum guaranteed interest of 4% to 4.5%. If the interest rates are continuously low, additional premiums may have to be paid to avoid a lapse of coverage. • Variable Life. This policy has death benefits and cash values that vary with the performance of an underlying portfolio of investments that you select. The death benefit and cash value are not guaranteed. They can go down as well as up, although there may be a guaranteed minimum death benefit. • Variable Universal. This policy combines the premium and death benefit flexibility of universal life with the investment flexibility and risk of variable life.",
      "On all of the above policies, riders are available at an additional cost for the following coverage's: Disability waiver of premium.",
      "A feature added to some life insurance policies providing for the waiver of premium, and sometimes payment of monthly income if the policyholder becomes totally and permanently disabled.",
      "Accidental death. A provision in a life insurance policy for payment of an additional benefit if death is caused by an accident. This is sometimes called double indemnity."
    ]
  },
  {
    "id": "6",
    "service": "Term Life Insurance",
    "slug": "term-life-insurance",
    "content": [
      "It provides protection for a specified period of time, typically from one to 30 years. It pays a death benefit only if you die during this term.",
      "Some policies can be automatically renewed at the end of the coverage period, and some can be converted to permanent insurance without need for a medical exam.",
      "There are several different types of term insurance you can consider:",
      "Renewable Term Insurance. These policies have a provision allowing you to renew coverage at the end of the term without having to show evidence of insurability. The company has to renew your policy even if your medical condition has deteriorated. However, the premium rate will rise with each renewal.",
      "Convertible Term Insurance. These policies allow you to convert your term coverage into a permanent policy without providing evidence of insurability. Premiums for convertible policies are usually higher than for nonconvertible policies. Once converted, the premiums for the permanent coverage will be higher than those of the term policy with the same death benefit. However, the permanent policy premiums will remain the same while the term premiums will rise.",
      "Level Term Insurance. These policies provide a fixed premium for a certain number of years, usually 10 or 20 years, while the death benefit remains unchanged. The death benefit is the amount the life insurance company will pay, as stated in the policy, when the insured person dies. The advantage is that you lock in a certain rate for the period of the policy. The disadvantage is that the premiums will tend to cost more than the earlier years of the renewable policy, and when the level policy expires, premium rates will jump considerably if you want to renew with another level policy.",
      "Decreasing Term Insurance. The death benefit in this type of policy decreases over its term. For example, you might start with $100,000 of coverage and the amount of coverage decreases by $10,000 each year for 10 years. The premium usually remains the same over the term of the policy. This type of insurance allows you to pay the same premium for less insurance over time, rather than have your premium increase for the same amount of insurance.",
      "Increasing Term Insurance. This kind of policy starts at one level of death benefit which gradually increases over the life of the policy. You may start with a $100,000 policy and increase the death benefit $10,000 each year for 10 years. The premium will increase each year. This kind of policy may be appropriate if you see your insurance needs growing in coming years because, for example, you expect to have more children."
    ]
  }
]
