[
  {
    "id": "1",
    "title": "dental",
    "slug": "dental",
    "content": [
      "Dental Insurance is equally important to Health Insurance because dental disease is still very prevalent.",
      "Dental care is a very important part of any healthy lifestyle, but because dental insurance or dental coverage is not included as part of standard health care insurance, it is something that is often overlooked or forgotten until it is too late. The rising cost of quality dental care means that dental insurance might be just what you and/or your family need to ensure that your teeth remain health and well cared for.",
      "Dental Insurance works very much like health insurance - they come in a variety of “flavors” if you will. PPO, DHMO, POS, Indemnity and Scheduled.",
      "PPO stands for Preferred Provider Organization. Basically, the network of dentists that the members are referred to offer discounted fees to the plan members.You can typically use a dentist outside of the PPO’s network, but you will only be reimbursed the discounted fee for the services rendered and have to pay any additional amount yourself.",
      "DHMO stands for Dental Health Maintenance Organization. The way a DHMO works is it provides you dental services through its network of dentists in exchange for some form of prepayment. If you use a dentist outside of the network, you will most likely be responsible for the entire bill.",
      "POS stands for Point of Service. A POS plan allows you to use either a DHMO dentist or a dentist not in the network. You get to choose in-network care of out-of-network care when you make your dental appointment and typically, you will incur higher out-of-pocket costs for out-of-network care.",
      "An indemnity plan is also known as a traditional plan. With an indemnity plan you can visit any dentist you like. They typically pay a percentage of “usual, customary and reasonable” charges for covered services.",
      "A scheduled plan or scheduled reimbursement plan reimburses you for a set amount based on a fee schedule. The balance due, if any is your responsibility. They include a calendar year maximum, a deductible and waiting periods for certain procedures.",
      "Most dental coverage is designed to ensure that the patient receives regular preventive care. There are three (3) categories of dental procedures. Preventative • Basic or Restorative • Major",
      "When you're shopping for a dental plan there are a number of things you'll need to keep in mind, to make sure that you end up with a policy that's right for you and your situation. As each individual and family have different circumstances please contact us today to evaluate your dental insurance needs and we will work to find the plan the best fits your needs and budget."
    ]
  },
  {
    "id": "2",
    "title": "group plans",
    "slug": "group-plans",
    "content": [
      "Business Groups Products: • Group Dental • Group Disability • Group Life • Group Long Term Care • Group Healt"
    ]
  }
]
